[
  {
    "id": 663,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/663",
    "assunto": "TOP 1896 - Não puxa o custo do produto, preço e custo tabelado",
    "descricao": "Bom dia, A TOP 1896 - Pedido Venda p/ Entrega Futura não está puxando os valores como deveria. Ao inserirmos o pedido o sistema deve puxar o custo de entrada do produto, o custo e o preço tabelado, assim que confirmado e os valores nao estão sendo preenchidos. Ultimamente, temos percebido que o preço tabelado só é preenchido ao informar o lote do produto, porém com o Pedido de Venda Futura, isso não acontece e o número de lote/controle somente é informado na remessa do produto. No entanto, a venda e o Financeiro são gerados na confirmaçao do pedido de Venda Futura, e possiveis liberaçoes de vendas abaixo do minimo permitido devem ser apontadas na confirmação do pedido. Sem os custos e o preço, a analise da venda não está sendo feita o que pode acontecer de termos vendas sem lucro e sem nosso consentimento.",
    "status": 5,
    "prioridade": 3,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047662434,
    "nome_solicitante": "Rafael Mesquita",
    "email_solicitante": "rafael@agrof.com.br",
    "created_at": "2024-05-02T11:03:50Z",
    "updated_at": "2024-06-06T01:56:01Z",
    "due_by": "2024-05-03T02:07:00Z",
    "is_escalated": false,
    "tags": [],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  },
  {
    "id": 650,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/650",
    "assunto": "Nota de Simples Remessa",
    "descricao": "Estamos com um problema na emissao da Simples Remessa (de Venda Futura), como a operação foi personalizada, o campo é calculado não consigo passar ao Suporte da Sankhya e preciso da ajuda da Unidade. O valor do produto é de 125.00 e o valor negociado foi de 95.00 (desconto de 30.00) realizado na Venda Futura, e na hora de gerar a simples remessa o sistema nao puxa o valor de 95.00, e está trazendo o valor de 125.00. O campo do valor unitario negociado está vindo bloqueado, nao conseguimos editar na Central de Vendas (Nota de Venda), mostra habilitado somente o valor unitario e se digitamos o valor correto de 95.00, o sistema muda o valor negociado e arrasta o desconto aplicado na venda futura, e o valor negociado muda pra 65.00. Tentei habilitar o campo no Layout da nota, mas por ser da ITE, nao me dá essa opçao, no dicionário esse campo AD_VLRNEG é calculado: #type.sql# SELECT (CASE WHEN CAB.TIPMOV = 'V' AND ITE.VLRUNIT > 0 THEN (((ITE.VLRUNIT * ITE.QTDNEG) - ITE.VLRDESC) / ITE.QTDNEG) ELSE ITE.VLRUNIT END) FROM TGFITE ITE JOIN TGFCAB CAB ON ITE.NUNOTA = CAB.NUNOTA WHERE TGFITE.NUNOTA = ITE.NUNOTA AND TGFITE.SEQUENCIA = ITE.SEQUENCIA Ao lançar a Simples Remessa, deveria puxar exatamente os valores da nota de orgiem (Venda Futura) mas nao está acontecendo isso, o campo de valor de desconto (VLRDESC) vem para a simples remessa zerado, consultei na ITE e também está zerado. Inserindo manualmente o valor de desconto dá o erro na SEFAZ e nao conseguimos faturar: 629 - Rejeição: Valor do Produto difere do produto Valor Unitário de Comercialização e Quantidade Comercial. Preciso de uma ajuda Urgente para corrigir e emitir as notas, estou com o faturamento travado e produtos para serem entregues.",
    "status": 5,
    "prioridade": 4,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047662434,
    "nome_solicitante": "Rafael Mesquita",
    "email_solicitante": "rafael@agrof.com.br",
    "created_at": "2024-04-12T16:27:16Z",
    "updated_at": "2024-04-19T17:37:33Z",
    "due_by": "2024-04-12T20:27:16Z",
    "is_escalated": true,
    "tags": [],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  },
  {
    "id": 640,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/640",
    "assunto": "RE: RES: Relatório de Comissão",
    "descricao": "Pessoal, bom dia!! Estou impressionado como estamos desde novembro de 2023 tentando resolver um problema simples e ele só piora a cada etapa de resolução!! Estou muito incomodado e inconformado com a falta de atenção e assistência da Sankhya neste tema!! Várias mãos para resolver um problema, o problema apontado é resolvido e após a resolução descobrimos que a Sankhya criou outro problema! Primeiro foi a resolução do valor em % das comissões dos vendedores da Agro F, resolvido! Quando vamos verificar os relatórios percebemos que todas as configurações iniciais do relatório foram retiradas! Passamos 3-4 meses pra resolver (que já é um absurdo) e quando vamos verificar constatamos que dados de comissão antes gerados corretamente estão errados! Sinceramente, não sei mais o que fazer sobre esse tema! Será que vamos esperar mais 3 a 4 meses para vocês resolverem o problema? Att., [cid:6510b91d-d356-48b2-add7-03d2eeeef7e6] ________________________________ De: Rafael Mesquita - Agro F <rafael@agrof.com.br> Enviado: quinta-feira, 28 de março de 2024 07:59 Para: 'Murilo Dias da Costa' <murilo.costa@sankhya.com.br>; 'Diogo Araujo' <diogo.araujo@agrof.com.br> Cc: 'Luan da Silva Ribeiro' <luan.silva@sankhya.com.br>; 'Bryan Gandolfi Candido' <bryan.candido@sankhya.com.br> Assunto: RES: RES: Relatório de Comissão Murilo, bom dia, tudo bem e contigo? Como ficou a rotina para visualização do Dash e geração do relatório, vocês vincularam à tela da Rotina de “Calculo de Comissao por Fórmula” ? Ou continua com a “FUNCTION” ativa? Precisamos ajustar de forma definitiva para não voltar a ter novos desencontros de valores. @Diogo Araujo<mailto:diogo.araujo@agrof.com.br> pode verificar os relatórios e confirmar os valores? Att, [cid:image001.png@01DA80E5.A17CD5B0] De: Murilo Dias da Costa <murilo.costa@sankhya.com.br> Enviada em: terça-feira, 26 de março de 2024 12:16 Para: Rafael Mesquita - Agro F <rafael@agrof.com.br> Cc: Luan da Silva Ribeiro <luan.silva@sankhya.com.br>; Diogo Araujo <diogo.araujo@agrof.com.br>; Bryan Gandolfi Candido <bryan.candido@sankhya.com.br> Assunto: Re: RES: Relatório de Comissão Rafael, bom dia, como vai? Ajuste do Dash de comissionamento e Relatório de comissionamento realizada, conforme pontos levantados no ticket #477 no Freshdesk - https://sankhyaindaiatuba.freshdesk.com/a/tickets/477 No ticket #477 foi sinalizado que os valores de faturamento e comissão não batiam tanto no Relatório quanto em nenhum dos níveis do Dashboard. Evidência do Ajuste: Filtros: Vendedor 15: Davi Período – Data de negociação: 01/01/2023 a 31/12/2023 * Gráfico geral do Dash: [cid:ii_lu8frshc2] * Explosão do gráfico: Coluna Amarela e Azul [cid:image002.png@01DA80E5.A17CD5B0] * Explosão da Grade de Nível Geral [cid:image003.png@01DA80E5.A17CD5B0] * Relatório de Comissão por Vendedor [cid:image004.png@01DA80E5.A17CD5B0] Em seg., 25 de mar. de 2024 às 16:34, Rafael Mesquita - Agro F <rafael@agrof.com.br<mailto:rafael@agrof.com.br>> escreveu: Luan, boa tarde, Segue abaixo todas as TOP’s que geram e calculam comissão, a crédito do Vendedor ou a Débito (no caso de Devolução de Vendas). Os registros em “Amarelo” são os que não aparecem nos Relatórios. Cód.Tipo Operação Descrição CREDITO/DÉBITO 1926 DEV. VENDA ORIG FAT P/ ENTR. FUTURA - DEBITA (VALOR NEGATIVO) 1200 DEVOLUÇÃO DE VENDA - NF PRÓPRIA - DEBITA (VALOR NEGATIVO) 1201 DEVOLUÇÃO DE VENDA - NF TERCEIROS - DEBITA (VALOR NEGATIVO) 1910 PEDIDO DE VENDA - ENTREGUE A FATURAR + CREDITA (POSITIVO) 1915 PEDIDO DE VENDA - REVENDA C/ ICMS + CREDITA (POSITIVO) 1901 PEDIDO DE VENDA - VENDA DIRETA + CREDITA (POSITIVO) 1112 SIMPLES REMESSA - ENTREGA FUTURA + CREDITA (POSITIVO) 1941 VENDA - ENTREGA A FATURAR + CREDITA (POSITIVO) 1902 VENDA DIRETA + CREDITA (POSITIVO) 1932 VENDA MERC ADQ TERC, ENT DEST P/ VEND, VDA ORDEM + CREDITA (POSITIVO) 1100 VENDA NF-E + CREDITA (POSITIVO) 1105 VENDA NFS-E + CREDITA (POSITIVO) Antes de finalizarem me retornem por favor, para validarmos. Usaremos a rotina de “Cálculo de Comissão por Fórmula” ? Conforme o Bryan havia sugerido, para corrigir de vez o problema. Att, [cid:image001.png@01DA80E5.A17CD5B0] De: Luan da Silva Ribeiro <luan.silva@sankhya.com.br<mailto:luan.silva@sankhya.com.br>> Enviada em: segunda-feira, 25 de março de 2024 15:27 Para: Rafael Mesquita - Agro F <rafael@agrof.com.br<mailto:rafael@agrof.com.br>>; Murilo Dias da Costa <murilo.costa@sankhya.com.br<mailto:murilo.costa@sankhya.com.br>> Cc: Diogo Araujo <diogo.araujo@agrof.com.br<mailto:diogo.araujo@agrof.com.br>> Assunto: Re: RES: Relatório de Comissão Boa tarde Rafael, Tudo bem? Amanhã o @Murilo Dias da Costa<mailto:murilo.costa@sankhya.com.br> irá voltar a mexer nesse ponto. Semana passada foram ajustados os dash. Amanhã vai para os relatórios. Quais são as TOP's que não aparecem no relatório? Luan Ribeiro Gerente de Projetos Sankhya Indaiatuba luan.ribeiro@sankhya.com.br<mailto:luan.ribeiro@sankhya.com.br> (12) 99119-9076 www.sankhya.com.br<http://www.sankhya.com.br> [http://www.sankhya.com.br/assinatura/assinatura_email_sankhya.gif] Em sex., 15 de mar. de 2024 às 18:16, Rafael Mesquita - Agro F <rafael@agrof.com.br<mailto:rafael@agrof.com.br>> escreveu: Luan, boa tarde, Antes de finalizarem, peça ao Murilo que me retorne pois temos 2 ou 3 TOP’s que não estavam sendo consideradas pelo relatório, mas que aparecem no Dash. Outro ponto, para que não tenhamos mais dores com isso, é de padronizar os cálculos para a tela de “Calculo de Comissao por Fórmula” e fazer com que o Dash e o relatório puxem as informações de lá. De toda maneira, aguardo o retorno de vocês. Precisamos urgente desses fechamentos. Obrigado. Abs, [cid:image001.png@01DA80E5.A17CD5B0] De: Luan da Silva Ribeiro <luan.silva@sankhya.com.br<mailto:luan.silva@sankhya.com.br>> Enviada em: sexta-feira, 15 de março de 2024 15:59 Para: Rafael Mesquita - Agro F <rafael@agrof.com.br<mailto:rafael@agrof.com.br>> Cc: Diogo Araujo <diogo.araujo@agrof.com.br<mailto:diogo.araujo@agrof.com.br>> Assunto: Re: RES: Relatório de Comissão Boa tarde Rafael, Como vai? Espero que bem. O Murilo está verificando e mapeando as diferenças geradas. Luan Ribeiro Gerente de Projetos Sankhya Indaiatuba luan.ribeiro@sankhya.com.br<mailto:luan.ribeiro@sankhya.com.br> (12) 99119-9076 www.sankhya.com.br<http://www.sankhya.com.br> [http://www.sankhya.com.br/assinatura/assinatura_email_sankhya.gif] Em qui., 14 de mar. de 2024 às 18:10, Rafael Mesquita - Agro F <rafael@agrof.com.br<mailto:rafael@agrof.com.br>> escreveu: Luan, boa tarde, tudo certo? Conseguiu verificar ? [cid:image005.jpg@01DA80E5.A17CD5B0] Iniciar mensagem encaminhada: De: Rafael Mesquita - Agro F <rafael@agrof.com.br<mailto:rafael@agrof.com.br>> Data: mar. 13, 2024 em 12:33 Para: Luan da Silva Ribeiro <luan.silva@sankhya.com.br<mailto:luan.silva@sankhya.com.br>> Assunto: RES: Relatório de Comissão Luan, boa tarde, Resumindo... temos 3 telas para conferência e validação dos valores e o relatório com apresenta o fechamento. Na implantação o Dash e o relatório estavam corretos e em funcionamento, porém no decorrer do uso, e sem realizarmos alterações, começou a apresentar valores diferentes. Final do ano passado solicitei a correção dos valores de porcentagem, porém os valores calculados de comissão estavam corretos, no entanto, depois disso deixou de mostrar os valores corretos no Dash e no relatório. Motivo que originou o novo chamado. No e-mail em anexo trocado com o Bryan, pode verificar o status da situação e conversa. Ele estava falando de concentrar as informações e puxar da TGFCOM, o que hoje não acontece e o sistema está puxando os valores através de uma FUNCTION. Se quiser me ligar ou fazer um Meet, acredito que fique mais fácil de lhe explicar. Hoje, além dos valores apresentados, o Dash e o relatório, não estão puxando algumas TOP’s, o que antes na implantação já estava validado. Fico no seu aguardo, obrigado. Att, [cid:image001.png@01DA80E5.A17CD5B0] De: Luan da Silva Ribeiro luan.silva@sankhya.com.br<mailto:luan.silva@sankhya.com.br> Enviada em: quarta-feira, 13 de março de 2024 10:21 Para: Rafael Mesquita - Agro F <rafael@agrof.com.br<mailto:rafael@agrof.com.br>> Assunto: Relatório de Comissão Bom dia Rafael! Como vai? O chamado sobre a comissão foi e voltou várias vezes, validado e reaberto para uma nova análise. Preciso quando houver um validação mesmo que parcial, por envolver outros indicadores (como dashboard) que seja aberto um novo, pode até referenciar o anterior, mas preciso de um novo, pois a plataforma perde a referências nas reaberturas. Mas voltando à situação da comissão, qual a real situação? Luan Ribeiro Gerente de Projetos Sankhya Indaiatuba luan.ribeiro@sankhya.com.br<mailto:luan.ribeiro@sankhya.com.br> (12) 99119-9076 www.sankhya.com.br<http://www.sankhya.com.br> [http://www.sankhya.com.br/assinatura/assinatura_email_sankhya.gif] -- Atenciosamente! Murilo Dias da Costa Desenvolvedor e Analista de ERP murilo.costa@sankhya.com.br<mailto:murilo.costa@sankhya.com.br> (11) 96497 - 6584 sankhya.com.br<http://sankhya.com.br/> [https://ci3.googleusercontent.com/mail-sig/AIorK4wVGdE17vPNxxG29oxjli-DGuayeOyRXFe2fW1i8pNERruwBDgPPxm7p9h26ln9YpNkClwWcLQ]",
    "status": 5,
    "prioridade": 1,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047673690,
    "nome_solicitante": "diogo. araujo@agrof. com. br",
    "email_solicitante": "diogo.araujo@agrof.com.br",
    "created_at": "2024-04-02T14:16:43Z",
    "updated_at": "2024-06-05T17:35:33Z",
    "due_by": "2024-04-05T14:16:43Z",
    "is_escalated": true,
    "tags": [],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  },
  {
    "id": 537,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/537",
    "assunto": "Atualizar fórmula Tabela de Preços: Corrente - Finaceira",
    "descricao": "Boa tarde, Estamos em fase final de implantação de um projeto, vinculado ao sistema, e precisamos atualizar a fórmula de cálculo das Tabelas de Preços do tipo: Corrente - Financeira (\"C\") Atualmente a tabela utiliza como cálculo Juros Simples e precisamos alterar somente para Cálculo com \"Juros Compostos\". A base de cálculo será a mesma já utilizada, utiliza o preço de venda tabelado, a data do dia de hoje como valor inicial e calcula a atualização de preços até a data de vencimento do pedido, utilizando também o valor de juros informado na tabela (TGFNTA). PF = PV*(1+J)N [data de vencimento do pedido - data negociação] Aguardo, obrigado.",
    "status": 5,
    "prioridade": 3,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047662434,
    "nome_solicitante": "Rafael Mesquita",
    "email_solicitante": "rafael@agrof.com.br",
    "created_at": "2024-02-09T20:28:55Z",
    "updated_at": "2024-02-14T17:24:18Z",
    "due_by": "2024-02-10T08:28:55Z",
    "is_escalated": true,
    "tags": [],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  },
  {
    "id": 477,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/477",
    "assunto": "RES: Relatorio de Comissao nao atualiza",
    "descricao": "Boa tarde, Deu certo de validarem e corrigirem o Relatorio de Comissionamento? Aguardo retorno. Obrigado. Att, De: diogo.araujo@agrof.com.br <diogo.araujo@agrof.com.br> Enviada em: sexta-feira, 5 de janeiro de 2024 18:03 Para: Rafael Mesquita - Agro F <rafael@agrof.com.br>; 'Sankhya - BP Indaiatuba' <support@sankhyaindaiatuba.freshdesk.com> Assunto: RE: Relatorio de Comissao nao atualiza Pessoal, preciso de uma data de quando essa correção do relatório ficará pronta. Estou enviando o relatório (devido ao nosso processo interno) para os consultores comerciais e estou recebendo reclamações diárias sobre isso. Eu só preciso que vocês registrem um prazo de entrega!! Pois dia 12/01/2024 completaremos 1 mês do r _____ De: Rafael Mesquita - Agro F <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > Enviado: quarta-feira, 3 de janeiro de 2024 07:14 Para: diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> <diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> >; 'Sankhya - BP Indaiatuba' <support@sankhyaindaiatuba.freshdesk.com <mailto:support@sankhyaindaiatuba.freshdesk.com> > Assunto: RES: Relatorio de Comissao nao atualiza Bom dia, No dia 20/12/23 descrevi detalhado o que o relatório deve mostrar. Segue: “Em Qua, 20 Dez na (o) 4:08 PM , Rafael Mesquita <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > escreveu: Boa tarde, Na ultima interação do chamado, onde fizeram a correção da porcentagem que não estava aparecendo corretamente, validamos o registro abaixo da NU 83141. No entanto, quando há vários itens em uma mesma nota o Dash e o relatório continuam apresentando o valor errado de porcentagem da comissão. A comissão de vendas paga pela Agro F é calculada por item, no exemplo abaixo podem verificar que os valores de comissão estão corretos, porém a porcentagem por item não bate. Para ficar mais fácil o entendimento, coloco abaixo a legenda de referencia das linhas: A linha em verde mostra o total somado de todas as vendas no período, a porcentagem da comissão em relação ao total e o valor total de comissão somado de todas as notas. A linha em vermelho, mostra o total de vendas somado por cliente, a porcentagem da comissão em relação ao total do cliente e o valor total de comissão referente ao cliente. A linha em preto, mostra o total da venda por nota, porcentagem da comissão em relação á nota e o valor somado de comissão da nota. As linhas em azul, referem-se a cada produto da nota, o valor por produto, a porcentagem de comissão paga pelo valor de venda do produto e o valor da comissão referente o produto. Assim sendo, se pegarmos como exemplo o primeiro registro, temos: Cliente 133 – Daniel Batista Nota 228 / Valor 4.253,00 / Comissão geral de 10% = 425,30 (Está ok, a porcentagem aqui é de acordo com o quanto o valor total da comissão somada representa do valor total da nota) No registro abaixo: Produto TRAT 10L – Valor 2.090,00 – Comissão de 209,00 – deveria apresentar a porcentagem de 10% (10% sobre o valor vendido do produto), e está mostrando a porcentagem de 4.91% (pela validação que fiz, está mostrando a porcentagem em relação ao valor total da venda 4.253,00). Onde o correto seria apresentar a porcentagem calculada sobre o valor de venda do produto que é de 10%. Essas porcentagens são definidas e calculadas de acordo com a tabela de preços e a banda de comissionamento e devem ser apresentadas exatamente conforme a “Fórmula de Comissão Calculada”. Precisamos que corrijam, pois com certeza no ultimo ajuste realizado, deva ter interferido na apresentação correta da porcentagem, devido ao valor em reais da comissão estar correto. <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODUyMjU2NDksImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.VB5mus1kssgM7XataYX6uQ3o2pOd0MHn2r2G7pOsYdI> Se ainda tiverem duvidas por favor me retornem em ligação ou Meet para explicar pessoalmente. Fico no aguardo. Att, De: diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> <diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> > Enviada em: terça-feira, 2 de janeiro de 2024 17:52 Para: rafael@agrof.com.br <mailto:rafael@agrof.com.br> ; Sankhya - BP Indaiatuba <support@sankhyaindaiatuba.freshdesk.com <mailto:support@sankhyaindaiatuba.freshdesk.com> > Assunto: RE: Relatorio de Comissao nao atualiza Prezados, o % é referente a comissão do item vendido e não da forma que foi explicado no último email. 10% de 2090,00 = 209,00 (Valor comissão) Porcentagem: valor da comissão paga no item vendido 10% (%) _____ De: Sankhya - BP Indaiatuba <support@sankhyaindaiatuba.freshdesk.com <mailto:support@sankhyaindaiatuba.freshdesk.com> > Enviado: terça-feira, 2 de janeiro de 2024 16:32 Para: rafael@agrof.com.br <mailto:rafael@agrof.com.br> <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > Cc: diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> <diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> > Assunto: Re: Relatorio de Comissao nao atualiza Olá Rafael Mesquita, tudo certo? Rafael analisei a situação, e o cálculo da porcentagem em cada quebra de linha por item está correto, porém creio que estamos com uma divergência sobre o cálculo desse campo. Anteriormente o relatório foi solicitado e validado, com o seguinte cálculo...na quebra de itens o campo %, seria referente à porcentagem do valor da comissão em cima do valor total da nota. Vamos usar a nota 228 de exemplo: 10% de 2090,00 = 209,00 (Valor comissão) Porcentagem: 209,00 de 4253,00 = 4,91% (%) <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODY0MjQwMTUsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.NJzZMfkJcbdeah_50yoXuAGFUEBJ9V23g8jlbhsbcsU> Em Ter, 2 Jan na (o) 11:29 AM , Rafael Mesquita <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > escreveu: Boa tarde, tudo bem e contigo? Sim, erro ainda se mantem. <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODYzODcxODAsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.ModvW8K406FwxwAQ_UANp4LRsx4BetgIb-CnwHzRIAo> Att, <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODYzODcxNzgsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.gG8Wj84t0q-AMA_BFKCLurQuWeICT2jXJkxB_JZyIVY> De: Sankhya - BP Indaiatuba <support@sankhyaindaiatuba.freshdesk.com <mailto:support@sankhyaindaiatuba.freshdesk.com> > Enviada em: terça-feira, 2 de janeiro de 2024 13:18 Para: rafael@agrof.com.br <mailto:rafael@agrof.com.br> Cc: diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> Assunto: Re: Relatorio de Comissao nao atualiza Olá Rafael​, Tudo bem ? O erro ainda persiste dentro do relatório ou ele foi resolvido ? Att, Em Ter, 26 Dez, 2023 na (o) 9:32 AM , Rafael Mesquita <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > escreveu: Bom dia, Aguardo retorno sobre o caso, se acaso precisarem de ajuda ou entendimento melhor por favor me liguem. (19) 3671-6857 (19) 99906-4655 (19) 99174-1740 – Whatsapp Obrigado. Att, <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODU2ODMzMDMsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.uope9Ma4ANfS-t0rMOHVld01o-_BiY8kVPfV8P5shvQ> De: Rafael Mesquita - Agro F <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > Enviada em: sexta-feira, 22 de dezembro de 2023 14:55 Para: 'Sankhya - BP Indaiatuba' <support@sankhyaindaiatuba.freshdesk.com <mailto:support@sankhyaindaiatuba.freshdesk.com> > Cc: 'diogo.araujo@agrof.com.br' <diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> > Assunto: RES: Relatorio de Comissao nao atualiza Oi boa tarde, Quando a NF possui mais de um item (conforme a imagem abaixo do relatório emitido nesse momento), os valores saem diferentes. O sistema mostra a porcentagem relativa ao total da nota e não a porcentagem da comissão paga pelo item. Pode confirmar, também na imagem abaixo, que quando a nota possui somente um item a porcentagem da comissão sai correto. <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODU2ODMzMDQsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.8P7PFiKMH6Gd7Edrh6iKa_9xUuh_c_bPE2QeOJEKIes> Att, <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODU2ODMzMDMsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.uope9Ma4ANfS-t0rMOHVld01o-_BiY8kVPfV8P5shvQ> De: Sankhya - BP Indaiatuba <support@sankhyaindaiatuba.freshdesk.com <mailto:support@sankhyaindaiatuba.freshdesk.com> > Enviada em: sexta-feira, 22 de dezembro de 2023 14:42 Para: rafael@agrof.com.br <mailto:rafael@agrof.com.br> Cc: diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> ; rafael@agrof.com.br <mailto:rafael@agrof.com.br> Assunto: Re: Relatorio de Comissao nao atualiza Olá Rafael Mesquita, Boa tarde! Conforme verificado hj dia 22/12 as 14:40 , esta mostrando 10% normal Relatorio <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODU1MTUyNzIsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ._YBqHl9pwHuxEpzqSatCvAlhaNzRpj8YNp2D7UBuhZw> DASH <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODU1MTU0OTksImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.rHLEGAdlE-9V_UhxbRudgYPdCPqVT9jDQnbji1ZQSqA> ​​ Em Qua, 20 Dez na (o) 4:08 PM , Rafael Mesquita <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > escreveu: Boa tarde, Na ultima interação do chamado, onde fizeram a correção da porcentagem que não estava aparecendo corretamente, validamos o registro abaixo da NU 83141. No entanto, quando há vários itens em uma mesma nota o Dash e o relatório continuam apresentando o valor errado de porcentagem da comissão. A comissão de vendas paga pela Agro F é calculada por item, no exemplo abaixo podem verificar que os valores de comissão estão corretos, porém a porcentagem por item não bate. Para ficar mais fácil o entendimento, coloco abaixo a legenda de referencia das linhas: A linha em verde mostra o total somado de todas as vendas no período, a porcentagem da comissão em relação ao total e o valor total de comissão somado de todas as notas. A linha em vermelho, mostra o total de vendas somado por cliente, a porcentagem da comissão em relação ao total do cliente e o valor total de comissão referente ao cliente. A linha em preto, mostra o total da venda por nota, porcentagem da comissão em relação á nota e o valor somado de comissão da nota. As linhas em azul, referem-se a cada produto da nota, o valor por produto, a porcentagem de comissão paga pelo valor de venda do produto e o valor da comissão referente o produto. Assim sendo, se pegarmos como exemplo o primeiro registro, temos: Cliente 133 – Daniel Batista Nota 228 / Valor 4.253,00 / Comissão geral de 10% = 425,30 (Está ok, a porcentagem aqui é de acordo com o quanto o valor total da comissão somada representa do valor total da nota) No registro abaixo: Produto TRAT 10L – Valor 2.090,00 – Comissão de 209,00 – deveria apresentar a porcentagem de 10% (10% sobre o valor vendido do produto), e está mostrando a porcentagem de 4.91% (pela validação que fiz, está mostrando a porcentagem em relação ao valor total da venda 4.253,00). Onde o correto seria apresentar a porcentagem calculada sobre o valor de venda do produto que é de 10%. Essas porcentagens são definidas e calculadas de acordo com a tabela de preços e a banda de comissionamento e devem ser apresentadas exatamente conforme a “Fórmula de Comissão Calculada”. Precisamos que corrijam, pois com certeza no ultimo ajuste realizado, deva ter interferido na apresentação correta da porcentagem, devido ao valor em reais da comissão estar correto. <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODUyMjU2NDksImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.VB5mus1kssgM7XataYX6uQ3o2pOd0MHn2r2G7pOsYdI> Aguardo retorno. Att, <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODUyMjU2NTAsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.sxdL_COCDfYicvQJI7VOAQqv4AwUrzJhd-VEv4le_8c> De: Sankhya - BP Indaiatuba <support@sankhyaindaiatuba.freshdesk.com <mailto:support@sankhyaindaiatuba.freshdesk.com> > Enviada em: terça-feira, 12 de dezembro de 2023 15:38 Para: rafael@agrof.com.br <mailto:rafael@agrof.com.br> Cc: diogo.araujo@agrof.com.br <mailto:diogo.araujo@agrof.com.br> Assunto: Re: Relatorio de Comissao nao atualiza Olá Rafael Mesquita, boa tarde. Cálculo corrigido, se possível validar novamente, por gentileza... ​Dash - Nível Geral: <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODQwMzM1MTAsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.t9Yppz484nnPfZAol9M0Z4c4LHxExWknHc4VVXFOvz8> Relatório: <https://attachment.freshdesk.com/inline/attachment?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpZCI6NzMwODQwMzM4MjcsImRvbWFpbiI6InNhbmtoeWFpbmRhaWF0dWJhLmZyZXNoZGVzay5jb20iLCJhY2NvdW50X2lkIjoyMzk0NDIxfQ.qS8ZwaBx4oq8xGqGyQySIEnMDMqE75WnZoMCnaN_Ges> Em Ter, 12 Dez na (o) 10:31 AM , Rafael Mesquita <rafael@agrof.com.br <mailto:rafael@agrof.com.br> > escreveu: Sitema nao está acatando a porcentagem real da comissão calculada/gerada para o vendedor e traz informaçao incorreta para o Relatorio de Comissao Por Vendedor, como também no Dash - Lista de Comissao de Vendedor por Faturamento, na listagem de acesso Nivel Geral. Na tela principal do Dash, clicando no graficao para explodir as informaçoes, no quadro de comissao por NF que abre, o valor aparece correto. (Em anexo) O valor em reais da comissão está correto, porém a porcentagem não é real, quando visualizamos no relatorio ou na listagem geral do Dash. Exemplo em anexo: NU 83141 / NF 11786 Valor da Venda: 6.750,00 Comissão: 10% = $675,00 Relatório e no Dash - Nivel geral, mostra o valor de comissão de 675,00 e a porcentagem de 3,5%, que na verdade deveria mostrar: \"10%\" Já validei e rodei o calculo de Formula por Comissao, atualizou o valor mas a porcentagem continua mostrando errado. Esse relatorio e o Dash foram criados na implantação e nao fizemos ou solicitamos modificações/alterações que justificaria o erro. Precisamos que validem e corrijam. Aguardo. Sankhya - BP Indaiatuba powered by Freshdesk <https://www.freshworks.com/freshdesk/lp/customer-support-software?utm_source=email-referral&utm_medium=email-referral&utm_campaign=sprout-portal> Sankhya - BP Indaiatuba powered by Freshdesk <https://www.freshworks.com/freshdesk/lp/customer-support-software?utm_source=email-referral&utm_medium=email-referral&utm_campaign=sprout-portal> Sankhya - BP Indaiatuba powered by Freshdesk <https://www.freshworks.com/freshdesk/lp/customer-support-software?utm_source=email-referral&utm_medium=email-referral&utm_campaign=sprout-portal> Sankhya - BP Indaiatuba powered by Freshdesk <https://www.freshworks.com/freshdesk/lp/customer-support-software?utm_source=email-referral&utm_medium=email-referral&utm_campaign=sprout-portal> 364:2394421",
    "status": 5,
    "prioridade": 1,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047662434,
    "nome_solicitante": "Rafael Mesquita",
    "email_solicitante": "rafael@agrof.com.br",
    "created_at": "2024-01-23T20:50:11Z",
    "updated_at": "2024-04-12T17:23:48Z",
    "due_by": "2024-01-26T20:50:11Z",
    "is_escalated": true,
    "tags": [],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  },
  {
    "id": 432,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/432",
    "assunto": "Posiçao de Estoque desatualizada - Sistema nao baixa a reserva",
    "descricao": "Notas de simples remessa nao estao dando baixa total do estoque, sistema está considerando somente parcial. Fica reserva em aberto, saldo pendente na Venda Futura e estoque sem dar baixa, com disponivel incorreto. Precisamos de soluçao urgente!!!! Pelo atendimento do suporte da Sankhya, foi nos passado: \" Conforme foi alinhado em nossas conexões, segue os pontos que foram percebidos e que levaram a ocorrer os erros: Como a explosão de lotes automática não está ativa, os lotes eram informados manualmente nas notas de remessa. Durante esse lançamento, existiam situações onde 1 produto era duplicado e inserido mais de um lote para o mesmo, no caso perdendo a ligação com os documentos de origem da remessa. Sem a ligação, os documentos de origem ficavam como reservados além de que no lançamento da remessa, os produtos estavam ficando sem tabela de preço. Para resolver então, foi recomendado utilizar o seguinte botão no lançamento da remessa, na central de vendas: Central de Vendas | Grade Itens > Botão Outras Opções Desmembrar item por lote Utilizando esse botão, a remessa não perderá os vínculos com os documentos de origem e também a precificação ficará correta.\" Foi passado a instruçao acima no entanto, continuamos com os problemas, as reservas continuam em sistema e nao conseguimos baixar, resolver manualmente. Precisamos que os ajustes sejam feitos diretamente nas tabelas de acordo com a relaçao de notas.",
    "status": 4,
    "prioridade": 3,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047662434,
    "nome_solicitante": "Rafael Mesquita",
    "email_solicitante": "rafael@agrof.com.br",
    "created_at": "2024-01-09T21:10:22Z",
    "updated_at": "2024-05-15T16:47:48Z",
    "due_by": "2024-01-10T09:10:22Z",
    "is_escalated": true,
    "tags": [
      "Pendente Cliente"
    ],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  },
  {
    "id": 431,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/431",
    "assunto": "Texto campo observaçoes da NF - de acordo com o produto vendido",
    "descricao": "Boa tarde, teremos que incluir em todas as notas fiscais emitidas que contiverem um determinado produto, o texto em anexo. Se faz necessário tal informação devido a tecnologia utilizada que é de propriedade intelectual da marca Monstanto Bayer Brasil.",
    "status": 5,
    "prioridade": 3,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047662434,
    "nome_solicitante": "Rafael Mesquita",
    "email_solicitante": "rafael@agrof.com.br",
    "created_at": "2024-01-09T20:00:16Z",
    "updated_at": "2024-02-23T17:48:12Z",
    "due_by": "2024-01-10T08:00:16Z",
    "is_escalated": true,
    "tags": [
      "Melhoria"
    ],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  },
  {
    "id": 364,
    "link_ticket": "https://sankhyaindaiatuba.freshdesk.com/support/tickets/364",
    "assunto": "Relatorio de Comissao nao atualiza",
    "descricao": "Sitema nao está acatando a porcentagem real da comissão calculada/gerada para o vendedor e traz informaçao incorreta para o Relatorio de Comissao Por Vendedor, como também no Dash - Lista de Comissao de Vendedor por Faturamento, na listagem de acesso Nivel Geral. Na tela principal do Dash, clicando no graficao para explodir as informaçoes, no quadro de comissao por NF que abre, o valor aparece correto. (Em anexo) O valor em reais da comissão está correto, porém a porcentagem não é real, quando visualizamos no relatorio ou na listagem geral do Dash. Exemplo em anexo: NU 83141 / NF 11786 Valor da Venda: 6.750,00 Comissão: 10% = $675,00 Relatório e no Dash - Nivel geral, mostra o valor de comissão de 675,00 e a porcentagem de 3,5%, que na verdade deveria mostrar: \"10%\" Já validei e rodei o calculo de Formula por Comissao, atualizou o valor mas a porcentagem continua mostrando errado. Esse relatorio e o Dash foram criados na implantação e nao fizemos ou solicitamos modificações/alterações que justificaria o erro. Precisamos que validem e corrijam. Aguardo.",
    "status": 5,
    "prioridade": 3,
    "tipo": "Suporte Técnico",
    "empresa_id": 73000980874,
    "requester_id": 73047662434,
    "nome_solicitante": "Rafael Mesquita",
    "email_solicitante": "rafael@agrof.com.br",
    "created_at": "2023-12-12T15:31:21Z",
    "updated_at": "2024-02-02T18:46:37Z",
    "due_by": "2023-12-13T03:31:21Z",
    "is_escalated": false,
    "tags": [],
    "group_id": null,
    "modulo": null,
    "processo": null,
    "personalizacao": null,
    "custom_fields": {
      "cf_mdulo": null,
      "cf_processo": null,
      "cf_processo6582": null,
      "cf_personalizao": null
    }
  }
]